;
;      ISO-8859-15        X16 Additions
;                           (inverted)
;
; 00|                | |@ABCDEFGHIJKLMNO|
; 10|                | |PQRSTUVWXYZ[\]^_|
; 20| !"#$%&'()*+,-./|
; 30|0123456789:;<=>?|
; 40|@ABCDEFGHIJKLMNO|
; 50|PQRSTUVWXYZ[\]^_|
; 60|`abcdefghijklmno|
; 70|pqrstuvwxyz{|}~ |
; 80|                | |`abcdefghijklmno|
; 90|                | |pqrstuvwxyz{|}~ |
; A0| ¡¢£€¥Š§š©ª«¬ ®¯|
; B0|°±²³Žµ¶·ž¹º»ŒœŸ¿|
; C0|ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ|
; D0|ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß|
; E0|àáâãäåæçèéêëìíîï|
; F0|ðñòóôõö÷øùúûüýþÿ|

.segment "CHARISO"

;
; 00 Control Codes
;
; |@ABCDEFGHIJKLMNO| (inverted)
; |PQRSTUVWXYZ[\]^_| (inverted)
;

; These are taken from PXLfont
.byte %████████
.byte %██____██
.byte %█__██__█
.byte %█__█___█
.byte %█__█___█
.byte %█__█████
.byte %██____██
.byte %████████

.byte %████████
.byte %██____██
.byte %█__██__█
.byte %█__██__█
.byte %█______█
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %████████
.byte %█_____██
.byte %█__██__█
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %█_____██
.byte %████████

.byte %████████
.byte %██_____█
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %██_____█
.byte %████████

.byte %████████
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█_____██
.byte %████████

.byte %████████
.byte %█______█
.byte %█__█████
.byte %█_____██
.byte %█__█████
.byte %█__█████
.byte %█______█
.byte %████████

.byte %████████
.byte %█______█
.byte %█__█████
.byte %█_____██
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %████████

.byte %████████
.byte %██_____█
.byte %█__█████
.byte %█__█___█
.byte %█__██__█
.byte %█__██__█
.byte %██_____█
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %█______█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %████████
.byte %██____██
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %██____██
.byte %████████

.byte %████████
.byte %███___██
.byte %████__██
.byte %████__██
.byte %████__██
.byte %█__█__██
.byte %██___███
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█__█__██
.byte %█____███
.byte %█____███
.byte %█__█__██
.byte %█__██__█
.byte %████████

.byte %████████
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %█______█
.byte %████████

.byte %████████
.byte %█__███__
.byte %█___█___
.byte %█_______
.byte %█__█_█__
.byte %█__███__
.byte %█__███__
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█___█__█
.byte %█______█
.byte %█__█___█
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %████████
.byte %██____██
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %████████

.byte %████████
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %█_____██
.byte %█__█████
.byte %█__█████
.byte %████████

.byte %████████
.byte %██____██
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %████___█

.byte %████████
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %████████
.byte %██____██
.byte %█__█████
.byte %█____███
.byte %███____█
.byte %█████__█
.byte %█_____██
.byte %████████

.byte %████████
.byte %█______█
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %███__███
.byte %████████

.byte %████████
.byte %█__███__
.byte %█__███__
.byte %█__█_█__
.byte %█__█_█__
.byte %█_______
.byte %██__█__█
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %██____██
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %███__███
.byte %███__███
.byte %███__███
.byte %████████

.byte %████████
.byte %█______█
.byte %████__██
.byte %███__███
.byte %██__████
.byte %█__█████
.byte %█______█
.byte %████████

.byte %████████
.byte %██____██
.byte %██__████
.byte %██__████
.byte %██__████
.byte %██__████
.byte %██____██
.byte %████████
; This is '/' from PXLfont, flipped
.byte %████████
.byte %██__████
.byte %██__████
.byte %███__███
.byte %███__███
.byte %████__██
.byte %████__██
.byte %████████

.byte %████████
.byte %██____██
.byte %████__██
.byte %████__██
.byte %████__██
.byte %████__██
.byte %██____██
.byte %████████
; This is the CBM/PXLfont character, edited
.byte %████████
.byte %███__███
.byte %██____██
.byte %█__██__█
.byte %████████
.byte %████████
.byte %████████
.byte %████████
; This is "_" taken from CP850 and inverted
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %________

;
; 20
;
; | !"#$%&'()*+,-./|
; |0123456789:;<=>?|

; These are taken from PXLfont
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________

.byte %________
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %________
.byte %___██___
.byte %________

.byte %________
.byte %__██_██_
.byte %__██_██_
.byte %__█__█__
.byte %________
.byte %________
.byte %________
.byte %________

.byte %________
.byte %__██_██_
.byte %_███████
.byte %__██_██_
.byte %__██_██_
.byte %_███████
.byte %__██_██_
.byte %________

.byte %________
.byte %___██___
.byte %___███__
.byte %__██____
.byte %__████__
.byte %____██__
.byte %__███___
.byte %___██___

.byte %________
.byte %_███__██
.byte %_█_█_██_
.byte %_██_██__
.byte %___██_██
.byte %__██_█_█
.byte %_██__███
.byte %________

.byte %________
.byte %__███___
.byte %_██_██__
.byte %__███___
.byte %_██_████
.byte %_██__██_
.byte %__██████
.byte %________

.byte %________
.byte %___██___
.byte %___██___
.byte %___█____
.byte %________
.byte %________
.byte %________
.byte %________

.byte %________
.byte %___██___
.byte %__██____
.byte %__██____
.byte %__██____
.byte %__██____
.byte %___██___
.byte %________

.byte %________
.byte %___██___
.byte %____██__
.byte %____██__
.byte %____██__
.byte %____██__
.byte %___██___
.byte %________

.byte %________
.byte %________
.byte %_██__██_
.byte %__████__
.byte %████████
.byte %__████__
.byte %_██__██_
.byte %________

.byte %________
.byte %________
.byte %___██___
.byte %___██___
.byte %_██████_
.byte %___██___
.byte %___██___
.byte %________

.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %___██___
.byte %___██___
.byte %__██____

.byte %________
.byte %________
.byte %________
.byte %________
.byte %_██████_
.byte %________
.byte %________
.byte %________

.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %___██___
.byte %___██___
.byte %________

.byte %________
.byte %____██__
.byte %____██__
.byte %___██___
.byte %___██___
.byte %__██____
.byte %__██____
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██_███_
.byte %_███_██_
.byte %_██__██_
.byte %__████__
.byte %________

.byte %________
.byte %___██___
.byte %__███___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %_██████_
.byte %________

.byte %________
.byte %_████___
.byte %____██__
.byte %____██__
.byte %___██___
.byte %__██____
.byte %_██████_
.byte %________

.byte %________
.byte %_██████_
.byte %____██__
.byte %___███__
.byte %_____██_
.byte %_____██_
.byte %_█████__
.byte %________

.byte %________
.byte %____██__
.byte %___██___
.byte %__██_██_
.byte %_██__██_
.byte %_██████_
.byte %_____██_
.byte %________

.byte %________
.byte %_█████__
.byte %_██_____
.byte %_█████__
.byte %_____██_
.byte %_____██_
.byte %_█████__
.byte %________

.byte %________
.byte %__████__
.byte %_██_____
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %________

.byte %________
.byte %_██████_
.byte %_____██_
.byte %____██__
.byte %____██__
.byte %___██___
.byte %___██___
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %__█████_
.byte %_____██_
.byte %__████__
.byte %________

.byte %________
.byte %________
.byte %___██___
.byte %___██___
.byte %________
.byte %___██___
.byte %___██___
.byte %________

.byte %________
.byte %________
.byte %___██___
.byte %___██___
.byte %________
.byte %___██___
.byte %___██___
.byte %__██____

.byte %________
.byte %________
.byte %____██__
.byte %___██___
.byte %__██____
.byte %___██___
.byte %____██__
.byte %________

.byte %________
.byte %________
.byte %________
.byte %_██████_
.byte %________
.byte %_██████_
.byte %________
.byte %________

.byte %________
.byte %________
.byte %__██____
.byte %___██___
.byte %____██__
.byte %___██___
.byte %__██____
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %____███_
.byte %___███__
.byte %________
.byte %___██___
.byte %________

;
; 40
;
; |@ABCDEFGHIJKLMNO|
; |PQRSTUVWXYZ[\]^_|

; These are taken from PXLfont
.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██_███_
.byte %_██_███_
.byte %_██_____
.byte %__████__
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %_██████_
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %________
.byte %_█████__
.byte %_██__██_
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %________

.byte %________
.byte %__█████_
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %__█████_
.byte %________

.byte %________
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %________

.byte %________
.byte %_██████_
.byte %_██_____
.byte %_█████__
.byte %_██_____
.byte %_██_____
.byte %_██████_
.byte %________

.byte %________
.byte %_██████_
.byte %_██_____
.byte %_█████__
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %________

.byte %________
.byte %__█████_
.byte %_██_____
.byte %_██_███_
.byte %_██__██_
.byte %_██__██_
.byte %__█████_
.byte %________

.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██████_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %________
.byte %__████__
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________

.byte %________
.byte %___███__
.byte %____██__
.byte %____██__
.byte %____██__
.byte %_██_██__
.byte %__███___
.byte %________

.byte %________
.byte %_██__██_
.byte %_██_██__
.byte %_████___
.byte %_████___
.byte %_██_██__
.byte %_██__██_
.byte %________

.byte %________
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %_██████_
.byte %________

.byte %________
.byte %_██___██
.byte %_███_███
.byte %_███████
.byte %_██_█_██
.byte %_██___██
.byte %_██___██
.byte %________

.byte %________
.byte %_██__██_
.byte %_███_██_
.byte %_██████_
.byte %_██_███_
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %________

.byte %________
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %_██_____
.byte %_██_____
.byte %________

.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %____███_

.byte %________
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %________
.byte %__████__
.byte %_██_____
.byte %_████___
.byte %___████_
.byte %_____██_
.byte %_█████__
.byte %________

.byte %________
.byte %_██████_
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %________

.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %________

.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %___██___
.byte %________

.byte %________
.byte %_██___██
.byte %_██___██
.byte %_██_█_██
.byte %_██_█_██
.byte %_███████
.byte %__██_██_
.byte %________

.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %___██___
.byte %___██___
.byte %___██___
.byte %________

.byte %________
.byte %_██████_
.byte %____██__
.byte %___██___
.byte %__██____
.byte %_██_____
.byte %_██████_
.byte %________

.byte %________
.byte %__████__
.byte %__██____
.byte %__██____
.byte %__██____
.byte %__██____
.byte %__████__
.byte %________
; This is '/' from PXLfont, flipped
.byte %________
.byte %__██____
.byte %__██____
.byte %___██___
.byte %___██___
.byte %____██__
.byte %____██__
.byte %________

.byte %________
.byte %__████__
.byte %____██__
.byte %____██__
.byte %____██__
.byte %____██__
.byte %__████__
.byte %________
; This is the CBM/PXLfont character, edited
.byte %________
.byte %___██___
.byte %__████__
.byte %_██__██_
.byte %________
.byte %________
.byte %________
.byte %________
; This is "_" taken from CP850
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %████████

;
; 60
;
; |`abcdefghijklmno|
; |pqrstuvwxyz{|}~ |

; This is ' from PXLfont, flipped
.byte %________
.byte %___██___
.byte %___██___
.byte %____█___
.byte %________
.byte %________
.byte %________
.byte %________
; These are taken from PXLfont
.byte %________
.byte %________
.byte %__████__
.byte %_____██_
.byte %__█████_
.byte %_██__██_
.byte %__█████_
.byte %________

.byte %________
.byte %_██_____
.byte %_██_██__
.byte %_███_██_
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %________

.byte %________
.byte %________
.byte %__█████_
.byte %_██_____
.byte %_██_____
.byte %_██_____
.byte %__█████_
.byte %________

.byte %________
.byte %_____██_
.byte %__██_██_
.byte %_██_███_
.byte %_██__██_
.byte %_██__██_
.byte %__█████_
.byte %________

.byte %________
.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██████_
.byte %_██_____
.byte %__████__
.byte %________

.byte %________
.byte %___████_
.byte %__██____
.byte %__████__
.byte %__██____
.byte %__██____
.byte %__██____
.byte %________

.byte %________
.byte %________
.byte %__█████_
.byte %_██__██_
.byte %_██__██_
.byte %__█████_
.byte %_____██_
.byte %__████__

.byte %________
.byte %_██_____
.byte %_██_██__
.byte %_███_██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %___██___
.byte %________
.byte %_████___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %_██████_
.byte %________

.byte %____██__
.byte %________
.byte %__████__
.byte %____██__
.byte %____██__
.byte %____██__
.byte %_██_██__
.byte %__███___

.byte %________
.byte %_██_____
.byte %_██__██_
.byte %_██_██__
.byte %_████___
.byte %_██_██__
.byte %_██__██_
.byte %________

.byte %________
.byte %__███___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________

.byte %________
.byte %________
.byte %_██████_
.byte %_██_█_██
.byte %_██_█_██
.byte %_██_█_██
.byte %_██_█_██
.byte %________

.byte %________
.byte %________
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %________

.byte %________
.byte %________
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %________

.byte %________
.byte %________
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %_██_____

.byte %________
.byte %________
.byte %__█████_
.byte %_██__██_
.byte %_██__██_
.byte %_██_███_
.byte %__██_██_
.byte %_____██_

.byte %________
.byte %________
.byte %_███_██_
.byte %__███___
.byte %__██____
.byte %__██____
.byte %_████___
.byte %________

.byte %________
.byte %________
.byte %__████__
.byte %_██_____
.byte %_██████_
.byte %_____██_
.byte %_█████__
.byte %________

.byte %________
.byte %__██____
.byte %__████__
.byte %__██____
.byte %__██____
.byte %__██____
.byte %___███__
.byte %________

.byte %________
.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__█████_
.byte %________

.byte %________
.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %___██___
.byte %________

.byte %________
.byte %________
.byte %_██___██
.byte %_██_█_██
.byte %_██_█_██
.byte %_███████
.byte %__██_██_
.byte %________

.byte %________
.byte %________
.byte %_██__██_
.byte %__████__
.byte %___██___
.byte %__████__
.byte %_██__██_
.byte %________

.byte %________
.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %__█████_
.byte %_____██_
.byte %__████__

.byte %________
.byte %________
.byte %_██████_
.byte %____██__
.byte %___██___
.byte %__██____
.byte %_██████_
.byte %________
; These are taken from CP850
.byte %____███_
.byte %___██___
.byte %___██___
.byte %_███____
.byte %___██___
.byte %___██___
.byte %____███_
.byte %________

.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %________

.byte %_███____
.byte %___██___
.byte %___██___
.byte %____███_
.byte %___██___
.byte %___██___
.byte %_███____
.byte %________

.byte %_███_██_
.byte %██_███__
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
; This is 0x7F, which is non-printable
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________

;
; 80 Control Codes
;
; |`abcdefghijklmno| (inverted)
; |pqrstuvwxyz{|}~ | (inverted)

; This is ' from PXLfont, flipped
.byte %████████
.byte %███__███
.byte %███__███
.byte %████_███
.byte %████████
.byte %████████
.byte %████████
.byte %████████
; These are taken from PXLfont
.byte %████████
.byte %████████
.byte %██____██
.byte %█████__█
.byte %██_____█
.byte %█__██__█
.byte %██_____█
.byte %████████

.byte %████████
.byte %█__█████
.byte %█__█__██
.byte %█___█__█
.byte %█__██__█
.byte %█__██__█
.byte %█_____██
.byte %████████

.byte %████████
.byte %████████
.byte %██_____█
.byte %█__█████
.byte %█__█████
.byte %█__█████
.byte %██_____█
.byte %████████

.byte %████████
.byte %█████__█
.byte %██__█__█
.byte %█__█___█
.byte %█__██__█
.byte %█__██__█
.byte %██_____█
.byte %████████

.byte %████████
.byte %████████
.byte %██____██
.byte %█__██__█
.byte %█______█
.byte %█__█████
.byte %██____██
.byte %████████

.byte %████████
.byte %███____█
.byte %██__████
.byte %██____██
.byte %██__████
.byte %██__████
.byte %██__████
.byte %████████

.byte %████████
.byte %████████
.byte %██_____█
.byte %█__██__█
.byte %█__██__█
.byte %██_____█
.byte %█████__█
.byte %██____██

.byte %████████
.byte %█__█████
.byte %█__█__██
.byte %█___█__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %███__███
.byte %████████
.byte %█____███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %█______█
.byte %████████

.byte %████__██
.byte %████████
.byte %██____██
.byte %████__██
.byte %████__██
.byte %████__██
.byte %█__█__██
.byte %██___███

.byte %████████
.byte %█__█████
.byte %█__██__█
.byte %█__█__██
.byte %█____███
.byte %█__█__██
.byte %█__██__█
.byte %████████

.byte %████████
.byte %██___███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %██____██
.byte %████████

.byte %████████
.byte %████████
.byte %█______█
.byte %█__█_█__
.byte %█__█_█__
.byte %█__█_█__
.byte %█__█_█__
.byte %████████

.byte %████████
.byte %████████
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %████████

.byte %████████
.byte %████████
.byte %██____██
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %████████

.byte %████████
.byte %████████
.byte %█_____██
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█_____██
.byte %█__█████

.byte %████████
.byte %████████
.byte %██_____█
.byte %█__██__█
.byte %█__██__█
.byte %█__█___█
.byte %██__█__█
.byte %█████__█

.byte %████████
.byte %████████
.byte %█___█__█
.byte %██___███
.byte %██__████
.byte %██__████
.byte %█____███
.byte %████████

.byte %████████
.byte %████████
.byte %██____██
.byte %█__█████
.byte %█______█
.byte %█████__█
.byte %█_____██
.byte %████████

.byte %████████
.byte %██__████
.byte %██____██
.byte %██__████
.byte %██__████
.byte %██__████
.byte %███___██
.byte %████████

.byte %████████
.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██_____█
.byte %████████

.byte %████████
.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██____██
.byte %███__███
.byte %████████

.byte %████████
.byte %████████
.byte %█__███__
.byte %█__█_█__
.byte %█__█_█__
.byte %█_______
.byte %██__█__█
.byte %████████

.byte %████████
.byte %████████
.byte %█__██__█
.byte %██____██
.byte %███__███
.byte %██____██
.byte %█__██__█
.byte %████████

.byte %████████
.byte %████████
.byte %█__██__█
.byte %█__██__█
.byte %█__██__█
.byte %██_____█
.byte %█████__█
.byte %██____██

.byte %████████
.byte %████████
.byte %█______█
.byte %████__██
.byte %███__███
.byte %██__████
.byte %█______█
.byte %████████
; These are taken from CP850 and inverted
.byte %████___█
.byte %███__███
.byte %███__███
.byte %█___████
.byte %███__███
.byte %███__███
.byte %████___█
.byte %████████

.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %███__███
.byte %████████

.byte %█___████
.byte %███__███
.byte %███__███
.byte %████___█
.byte %███__███
.byte %███__███
.byte %█___████
.byte %████████

.byte %█___█__█
.byte %__█___██
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
; This is based on 0x7F, which is non-printable
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████
.byte %████████

;
; A0
;
; | ¡¢£€¥Š§š©ª«¬ ®¯|
; |°±²³Žµ¶·ž¹º»ŒœŸ¿|

; NBSP
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
; ¡ (CP850 AD)
.byte %___██___
.byte %________
.byte %___██___
.byte %___██___
.byte %__████__
.byte %__████__
.byte %___██___
.byte %________
; ¢ (CP850 BD)
.byte %___██___
.byte %___██___
.byte %_██████_
.byte %██______
.byte %██______
.byte %_██████_
.byte %___██___
.byte %___██___
; £ (PXLfont)
.byte %________
.byte %___███__
.byte %__██__█_
.byte %__██____
.byte %_████___
.byte %__██____
.byte %_██████_
.byte %________
; € TODO
.byte %___████_
.byte %__██__██
.byte %_████___
.byte %__██____
.byte %_████___
.byte %__██__██
.byte %___████_
.byte %________
; ¥ (CP850 BE)
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %_██████_
.byte %___██___
.byte %_██████_
.byte %___██___
.byte %___██___
; Š TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; § (CP850 15)
.byte %__█████_
.byte %_██____█
.byte %__████__
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %█____██_
.byte %_█████__
; š TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; © (CP850 B8)
.byte %_██████_
.byte %█______█
.byte %█__███_█
.byte %█_█____█
.byte %█_█____█
.byte %█__███_█
.byte %█______█
.byte %_██████_
; ª TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; « (CP850 AE)
.byte %________
.byte %__██__██
.byte %_██__██_
.byte %██__██__
.byte %_██__██_
.byte %__██__██
.byte %________
.byte %________
; ¬ (CP850 AA)
.byte %________
.byte %________
.byte %________
.byte %███████_
.byte %_____██_
.byte %_____██_
.byte %________
.byte %________
; SHY (nonprintable)
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
; ® (CP850 A9)
.byte %_██████_
.byte %█______█
.byte %█_███__█
.byte %█_█__█_█
.byte %█_███__█
.byte %█_█__█_█
.byte %█______█
.byte %_██████_
; ¯ (CP850 EE)
.byte %████████
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
.byte %________
; ° (CP850 F8)
.byte %__███___
.byte %_██_██__
.byte %_██_██__
.byte %__███___
.byte %________
.byte %________
.byte %________
.byte %________
; ± (CP850 F1)
.byte %___██___
.byte %___██___
.byte %_██████_
.byte %___██___
.byte %___██___
.byte %________
.byte %_██████_
.byte %________
; ² (CP850 FD)
.byte %_████___
.byte %____██__
.byte %___██___
.byte %__██____
.byte %_█████__
.byte %________
.byte %________
.byte %________
; ³ (CP850 FC)
.byte %_████___
.byte %____██__
.byte %__███___
.byte %____██__
.byte %_████___
.byte %________
.byte %________
.byte %________
; Ž TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; µ (CP850 E6)
.byte %________
.byte %________
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %██______
; ¶ (CP850 F4)
.byte %_███████
.byte %██_██_██
.byte %██_██_██
.byte %_████_██
.byte %___██_██
.byte %___██_██
.byte %___██_██
.byte %________
; · (CP850 FA)
.byte %________
.byte %________
.byte %________
.byte %___██___
.byte %________
.byte %________
.byte %________
.byte %________
; ž TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; ¹ (CP850 FB)
.byte %___██___
.byte %__███___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
.byte %________
.byte %________
; º (CP850 A7)
.byte %__███___
.byte %_██_██__
.byte %_██_██__
.byte %__███___
.byte %________
.byte %_█████__
.byte %________
.byte %________
; » (CP850 AF)
.byte %________
.byte %██__██__
.byte %_██__██_
.byte %__██__██
.byte %_██__██_
.byte %██__██__
.byte %________
.byte %________
; Œ TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; œ TODO
.byte %████████
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %█______█
.byte %████████
; Ÿ (CP850 98)
.byte %██___██_
.byte %________
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_██████_
.byte %_____██_
.byte %██████__
; ¿ (CP850 A8)
.byte %___██___
.byte %________
.byte %___██___
.byte %___██___
.byte %__██____
.byte %_██___██
.byte %__█████_
.byte %________

;
; C0
;
; |ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ|
; |ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß|

; À (CP850 B7
.byte %___██___
.byte %____██__
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %███████_
.byte %██___██_
.byte %________
; Á (CP850 B5
.byte %__██____
.byte %_██_____
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %███████_
.byte %██___██_
.byte %________
; Â (CP850 B6
.byte %_█████__
.byte %█_____█_
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %███████_
.byte %██___██_
.byte %________
; Ã (CP850 C7)
.byte %_███_██_
.byte %██_███__
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %███████_
.byte %██___██_
.byte %________
; Ä (CP850 8E)
.byte %██___██_
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %███████_
.byte %██___██_
.byte %██___██_
.byte %________
; Å (CP850 8F)
.byte %__███___
.byte %_██_██__
.byte %_█████__
.byte %██___██_
.byte %███████_
.byte %██___██_
.byte %██___██_
.byte %________
; Æ (CP850 92)
.byte %__█████_
.byte %_██_██__
.byte %██__██__
.byte %███████_
.byte %██__██__
.byte %██__██__
.byte %██__███_
.byte %________
; Ç (CP850 80)
.byte %_█████__
.byte %██___██_
.byte %██______
.byte %██______
.byte %██___██_
.byte %_█████__
.byte %____██__
.byte %_████___
; È (CP850 D4)
.byte %__██____
.byte %___██___
.byte %███████_
.byte %██______
.byte %██████__
.byte %██______
.byte %███████_
.byte %________
; É (CP850 90)
.byte %___██___
.byte %__██____
.byte %███████_
.byte %██______
.byte %█████___
.byte %██______
.byte %███████_
.byte %________
; Ê (CP850 D2)
.byte %_█████__
.byte %█_____█_
.byte %███████_
.byte %██______
.byte %██████__
.byte %██______
.byte %███████_
.byte %________
; Ë (CP850 D3)
.byte %██___██_
.byte %________
.byte %███████_
.byte %██______
.byte %██████__
.byte %██______
.byte %███████_
.byte %________
; Ì (CP850 DE)
.byte %__██____
.byte %___██___
.byte %__████__
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; Í (CP850 D6)
.byte %____██__
.byte %___██___
.byte %__████__
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; Î (CP850 D7)
.byte %__████__
.byte %_█____█_
.byte %__████__
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; Ï (CP850 D8)
.byte %_██__██_
.byte %________
.byte %__████__
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; Ð (CP850 D1)
.byte %█████___
.byte %_██_██__
.byte %_██__██_
.byte %████_██_
.byte %_██__██_
.byte %_██_██__
.byte %█████___
.byte %________
; Ñ (CP850 A5)
.byte %_███_██_
.byte %██_███__
.byte %________
.byte %███__██_
.byte %████_██_
.byte %██_████_
.byte %██__███_
.byte %________
; Ò (CP850 E3)
.byte %____██__
.byte %_____██_
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %_██_██__
.byte %__███___
.byte %________
; Ó (CP850 E0)
.byte %__██____
.byte %_██_____
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %_██_██__
.byte %__███___
.byte %________
; Ô (CP850 E2)
.byte %_█████__
.byte %█_____█_
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %_██_██__
.byte %__███___
.byte %________
; Õ (CP850 E5)
.byte %_███_██_
.byte %██_███__
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %_██_██__
.byte %__███___
.byte %________
; Ö (CP850 99)
.byte %██___██_
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %██___██_
.byte %_██_██__
.byte %__███___
.byte %________
; × (CP850 9E)
.byte %________
.byte %██___██_
.byte %_██_██__
.byte %__███___
.byte %_██_██__
.byte %██___██_
.byte %________
.byte %________
; Ø (CP850 9D)
.byte %__███_█_
.byte %_██_██__
.byte %██__███_
.byte %██_█_██_
.byte %███__██_
.byte %_██_██__
.byte %█_███___
.byte %________
; Ù (CP850 EB)
.byte %_██_____
.byte %__██____
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; Ú (CP850 E9)
.byte %___██___
.byte %__██____
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; Û (CP850 EA)
.byte %_█████__
.byte %█_____█_
.byte %________
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; Ü (CP850 9A)
.byte %██___██_
.byte %________
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; Ý (CP850 ED)
.byte %____██__
.byte %___██___
.byte %_██__██_
.byte %_██__██_
.byte %__████__
.byte %___██___
.byte %__████__
.byte %________
; Þ (CP850 E7)
.byte %███_____
.byte %_██_____
.byte %_█████__
.byte %_██__██_
.byte %_██__██_
.byte %_█████__
.byte %_██_____
.byte %████____
; ß (CP850 E1)
.byte %_████___
.byte %██__██__
.byte %██__██__
.byte %██_██___
.byte %██__██__
.byte %██___██_
.byte %██__██__
.byte %________


;
; E0
;
; |àáâãäåæçèéêëìíîï|
; |ðñòóôõö÷øùúûüýþÿ|

; à (CP850 85)
.byte %__██____
.byte %___██___
.byte %_████___
.byte %____██__
.byte %_█████__
.byte %██__██__
.byte %_███_██_
.byte %________
; á (CP850 A0)
.byte %___██___
.byte %__██____
.byte %_████___
.byte %____██__
.byte %_█████__
.byte %██__██__
.byte %_███_██_
.byte %________
; â (CP850 83)
.byte %_█████__
.byte %█_____█_
.byte %_████___
.byte %____██__
.byte %_█████__
.byte %██__██__
.byte %_███_██_
.byte %________
; ã (CP850 C6)
.byte %_███_██_
.byte %██_███__
.byte %_█████__
.byte %_____██_
.byte %_██████_
.byte %██___██_
.byte %_██████_
.byte %________
; ä (CP850 84)
.byte %██___██_
.byte %________
.byte %_████___
.byte %____██__
.byte %_█████__
.byte %██__██__
.byte %_███_██_
.byte %________
; å (CP850 86)
.byte %__██____
.byte %__██____
.byte %_████___
.byte %____██__
.byte %_█████__
.byte %██__██__
.byte %_███_██_
.byte %________
; æ (CP850 91)
.byte %________
.byte %________
.byte %_██████_
.byte %___█__█_
.byte %███████_
.byte %█__█____
.byte %███████_
.byte %________
; ç (CP850 87)
.byte %________
.byte %________
.byte %_██████_
.byte %██______
.byte %██______
.byte %_██████_
.byte %____██__
.byte %__███___
; è (CP850 8A)
.byte %__██____
.byte %___██___
.byte %_█████__
.byte %██___██_
.byte %███████_
.byte %██______
.byte %_█████__
.byte %________
; é (CP850 82)
.byte %____██__
.byte %___██___
.byte %_█████__
.byte %██___██_
.byte %███████_
.byte %██______
.byte %_█████__
.byte %________
; ê (CP850 88)
.byte %_█████__
.byte %█_____█_
.byte %_█████__
.byte %██___██_
.byte %███████_
.byte %██______
.byte %_█████__
.byte %________
; ë (CP850 89)
.byte %██___██_
.byte %________
.byte %_█████__
.byte %██___██_
.byte %███████_
.byte %██______
.byte %_█████__
.byte %________
; ì (CP850 8D)
.byte %██___██_
.byte %________
.byte %_█████__
.byte %██___██_
.byte %███████_
.byte %██______
.byte %_█████__
.byte %________
; í (CP850 A1)
.byte %____██__
.byte %___██___
.byte %________
.byte %__███___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; î (CP850 8C)
.byte %_█████__
.byte %█_____█_
.byte %__███___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; ï (CP850 8B)
.byte %_██__██_
.byte %________
.byte %__███___
.byte %___██___
.byte %___██___
.byte %___██___
.byte %__████__
.byte %________
; ð (CP850 D0)
.byte %__██____
.byte %_██████_
.byte %____██__
.byte %_█████__
.byte %██__██__
.byte %██__██__
.byte %_████___
.byte %________
; ñ (CP850 A4)
.byte %_███_██_
.byte %██_███__
.byte %________
.byte %██_███__
.byte %_██__██_
.byte %_██__██_
.byte %_██__██_
.byte %________
; ò (CP850 95)
.byte %__██____
.byte %___██___
.byte %_█████__
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; ó (CP850 A2)
.byte %____██__
.byte %___██___
.byte %_█████__
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; ô (CP850 93)
.byte %_█████__
.byte %█_____█_
.byte %_█████__
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; õ (CP850 E4)
.byte %_███_██_
.byte %██_███__
.byte %_█████__
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; ö (CP850 94)
.byte %██___██_
.byte %________
.byte %_█████__
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_█████__
.byte %________
; ÷ (CP850 F6)
.byte %________
.byte %___██___
.byte %________
.byte %_██████_
.byte %________
.byte %___██___
.byte %________
.byte %________
; ø (CP850 9B)
.byte %________
.byte %______█_
.byte %_█████__
.byte %██__███_
.byte %██_█_██_
.byte %███__██_
.byte %_█████__
.byte %█_______
; ù (CP850 97)
.byte %_██_____
.byte %__██____
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %_███_██_
.byte %________
; ú (CP850 A3)
.byte %___██___
.byte %__██____
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %_███_██_
.byte %________
; û (CP850 96)
.byte %_████___
.byte %█____█__
.byte %________
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %_███_██_
.byte %________
; ü (CP850 81)
.byte %██__██__
.byte %________
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %██__██__
.byte %_███_██_
.byte %________
; ý (CP850 EC)
.byte %___██___
.byte %__██____
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_██████_
.byte %_____██_
.byte %██████__
; þ (CP850 E8)
.byte %████____
.byte %_██_____
.byte %_█████__
.byte %_██__██_
.byte %_█████__
.byte %_██_____
.byte %████____
.byte %________
; ÿ (CP850 98)
.byte %██___██_
.byte %________
.byte %██___██_
.byte %██___██_
.byte %██___██_
.byte %_██████_
.byte %_____██_
.byte %██████__
